title: Fastjson AutoType Deserialization Attack Attempt
id: e5f7a9b1-4c6d-8e0f-2a3b-5c7d9e1f3a5b
status: stable
level: critical
description: >
  Detects Fastjson deserialization attacks by matching @type field with known
  dangerous Java classes in HTTP POST request bodies.
references:
  - https://nvd.nist.gov/vuln/detail/CVE-2017-18349
  - https://github.com/alibaba/fastjson/wiki/security_update_20170315
author: Security Lab
date: 2026/05/21
tags:
  - attack.initial_access
  - attack.t1190
  - attack.execution
  - attack.t1059.004
  - cve.2017.18349
logsource:
  category: webserver
detection:
  selection_method:
    cs-method: 'POST'
  selection_body:
    request_body|contains:
      - '"@type":"com.sun.rowset.JdbcRowSetImpl"'
      - '"@type":"com.sun.org.apache.xalan'
      - '"@type":"org.apache.commons.dbcp'
      - '"@type":"com.mchange.v2.c3p0'
      - '"@type":"org.apache.ibatis.datasource.jndi'
  condition: selection_method and selection_body
falsepositives:
  - Security scanners testing for Fastjson vulnerabilities
